In [1]:
import pandas as pd
import numpy as np

Q1 (01Dec2024)

In [6]:
df = pd.read_csv('data.csv', header=None)

In [7]:
df

                 0
0    76569   66648
1    38663   66530
2    60350   60777
3    35330   13469
4    88681   66648
..             ...
995  76809   13023
996  56403   10503
997  23533   40965
998  82416   74888
999  24373   20896

[1000 rows x 1 columns]

In [12]:
df[['number1', 'number2']] = df[0].str.split(expand=True)

In [13]:
df

                 0 number1 number2
0    76569   66648   76569   66648
1    38663   66530   38663   66530
2    60350   60777   60350   60777
3    35330   13469   35330   13469
4    88681   66648   88681   66648
..             ...     ...     ...
995  76809   13023   76809   13023
996  56403   10503   56403   10503
997  23533   40965   23533   40965
998  82416   74888   82416   74888
999  24373   20896   24373   20896

[1000 rows x 3 columns]

In [46]:
df_sorted1 = df.sort_values(by='number1', ascending=True)
df1 = df_sorted1.drop(columns=[0, 'number2'])
df1 = df1['number1'].reset_index(drop=True)

df_sorted2 = df.sort_values(by='number2', ascending=True)
df2 = df_sorted2.drop(columns=[0, 'number1'])
df2 = df2['number2'].reset_index(drop=True)

In [49]:
df_combined = pd.concat([df1, df2], axis=1)
df_combined

    number1 number2
0     10053   10004
1     10073   10076
2     10269   10099
3     10341   10197
4     10463   10480
..      ...     ...
995   99405   98917
996   99530   99015
997   99574   99652
998   99634   99767
999   99877   99853

[1000 rows x 2 columns]

In [47]:
sum=0
for i in range(0, len(df)):
    x=int (df1[i])-int (df2[i])
    if (x<0):
        x=x*(-1)
    sum=sum+x

In [48]:
sum

3246517

Q2 （01Dec2024)

In [51]:
sum2=0
for i in range(0, len(df)):
    for j in range(0, len(df)):
        count=0
        if (df2[j] == df1[i]):
            count+=1
        sum2=sum2+int (df1[i])*count

In [52]:
sum2

29379307